### 데이터 프레임 연습문제

In [5]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

### 예제 2
아래 데이터 프레임을 사용하여 index가 four인 행의 값을 [1999, 'Ohio', 3.2, 0]으로 변경하시오.

In [9]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2002, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

frame = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])

frame

       year   state  pop debt
one    2002    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

### 예제 3
frame에서 index가 two, column이 state 인 위치의 값을 'Nevada'로 변경하시오.

### 예제 4 
frame에 year=2002이고 state='Ohio' 일때 True를 갖는 etc 컬럼을 생성하시오.

### 예제 6 
임의의 데이터 프레임을 생성하고 각 행과 열의 합을 각각 계산하여 출력하시오.

### 예제 7
아래 int_frame을 index, column기준으로 정렬하시오. (단, index, column 모두 정렬되어야 함)<br>

In [18]:
int_frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'b', 'c', 'a'])
int_frame

       d  b  c  a
three  0  1  2  3
one    4  5  6  7

### 예제 9
아래 주어진 df 에서 <br>
2~3행에서 '0'컬럼을 None으로 <br>
0~2행에서 '2'컬럼을 None으로 변경하시오.<br>
마지막으로 각 컬럼의 None값들을 각 컬럼의 평균값으로 채우시오.
column = 0, 1, 2

In [19]:
df = DataFrame(np.arange(21).reshape(7, 3))
df

    0   1   2
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14
5  15  16  17
6  18  19  20

<br><br><br><br><br><br><br><br><br><br><br>

### 정답
아래 각 셀이 각 문제의 정답

In [11]:
# 2번
frame.loc['four'] = [1999, 'Ohio', 3.2, 0]
frame

       year   state  pop debt
one    2002    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   1999    Ohio  3.2    0
five   2002  Nevada  2.9  NaN

In [14]:
# 3번
frame.loc['two', 'state'] = 'Nevada'
frame

       year   state  pop debt
one    2002    Ohio  1.5  NaN
two    2001  Nevada  1.7  NaN
three  2002    Ohio  3.6  NaN
four   1999    Ohio  3.2    0
five   2002  Nevada  2.9  NaN

In [15]:
# 4번
frame['etc'] = ((frame.state == 'Ohio') & (frame.year == 2002))
frame

       year   state  pop debt    etc
one    2002    Ohio  1.5  NaN   True
two    2001  Nevada  1.7  NaN  False
three  2002    Ohio  3.6  NaN   True
four   1999    Ohio  3.2    0  False
five   2002  Nevada  2.9  NaN  False

In [21]:
# 6번

frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])


print(frame,"\n")

# lambda 식 또는 함수를 정의하여 활용 (둘중 하나의 방식 선택)
f = lambda x: x.sum()

def f1(x):
    mul = 0
    for i in x:
        mul=mul+i

    return mul

    
#열의 합
print("열 합\n",frame.apply(f),"\n")

#행의 합
print("행 합\n",frame.apply(f1, axis=1))

               b         d         e
Utah    0.051936  0.866252 -1.741412
Ohio    0.204243  1.034444  0.632589
Texas   1.048563 -0.653184 -0.640634
Oregon -0.181446 -1.333180 -0.801973

열 합
 b    1.123295
d   -0.085667
e   -2.551431
dtype: float64

행 합
 Utah     -0.823224
Ohio      1.871275
Texas    -0.245256
Oregon   -2.316599
dtype: float64

In [22]:
# 7번
int_frame.sort_index().sort_index(axis=1)

       a  b  c  d
one    7  5  6  4
three  3  1  2  0

In [24]:
# 9번
df.loc[2:3, 0] = None; 
df.loc[:2, 2] = None
df.fillna({0:df[0].mean(), 1:df[1].mean(), 2:df[2].mean()})

      0   1     2
0   0.0   1  15.5
1   3.0   4  15.5
2   9.6   7  15.5
3   9.6  10  11.0
4  12.0  13  14.0
5  15.0  16  17.0
6  18.0  19  20.0